---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsRailingConnection
source: html/496a1581-bce7-05e4-400a-79bd9a899516.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsRailingConnection Property

"Rail Connections"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsRailingConnection { get; }
```